import React from 'react'
import { View, Text, TouchableOpacity, ScrollView } from 'react-native'

import { ArrowLeftIcon } from 'react-native-heroicons/solid'

export default function InformationModal({ OnClose }) {
  return (
      <ScrollView>
          <View className="flex-row justify-start mt-5">
            <TouchableOpacity
              onPress={OnClose}
              className="bg-white p-2 rounded-md shadow-md ml-4">
              <ArrowLeftIcon size="20" color="black" />
            </TouchableOpacity>
          </View>
          <View className=" flex-1 p-10 pt-5 gap-3">
            <Text className="text-2xl mb-5">Інформація про додаток</Text>
            <Text className="text-gray-700 ml-3">
              Мобільний додаток розроблявся для оцінки проведення сеансів
              з гіпоксичних тренувань.{' '}
            </Text>
            <Text className="text-gray-900 ml-4 text-lg">Гіпоксичні тренування: </Text>
            <Text className="text-gray-700 ml-4">
             Це альтернативний шлях безмедикаментозного способу підвищення
             резистентності організму. {'\n'}
             Метод гіпокситерапії використовує унікальний генетично зумовлений
             феномен людського організму, який полягає в тому, що у відповідь
             на зниження надходження кисню до тканин організм пристосовується
             до нових умов, компенсуючи порушення на всіх рівнях. Після повного
             відновлення порушеної функції відбувається надвідновлення і з кожною
             подальшою дією цього фактора стійкість організму збільшується.
            </Text>
            <Text className="text-gray-900 ml-4 text-lg">Сфери використання ІНГТ: </Text>
            <Text className="text-gray-700 ml-4">
              Інтервальні нормобаричні гіпоксичні тренування (ІНГТ) {'\n'}
              • профілактика висотної хвороби; {'\n'}
              • профілактика десинхроноза при зміні часових поясів; {'\n'}
              • профілактика виникнення серцево-судинних захворювань; {'\n'}
              • профілактика розвитку вікових захворювань; {'\n'}
              • профілактика передчасного старіння; {'\n'}
              • підвищення функціональних можливостей організму з метою підготовки до
              інтенсивних навантажень і роботі в екстремальних умовах; {'\n'}
              • підвищення витривалості, фізичної та розумової працездатності; {'\n'}
              • підвищення стійкості до стресу; {'\n'}
              • збільшення професійного довголіття осіб небезпечних професій. {'\n'}

            </Text>
            <Text className="text-gray-900 ml-4 text-lg">Призначення комплексу:</Text>
            <Text className="text-gray-700 ml-4">
              • тестування на визначення індивідуального рівня стійкості
              до гіпоксії пацієнтів та спортсменів; {'\n'}
              • проведення сеансів гіпоксичних тренувань в автоматичному
              і ручному режимах; {'\n'}
              • ведення статистики проведених сеансів гіпоксичної терапії
              з можливістю візуалізації даних на монітор персонального
              комп'ютера та експорту інформації для подальшого аналізу.{'\n'}
            </Text>

            <Text className="text-gray-900 ml-4 text-lg">
             Призначений для використання у:{' '}
            </Text>
            <Text className="text-gray-700 ml-4">
              • медичних центрах; {'\n'}
              • поліклініках і лікарнях; {'\n'}
              • санаторіях, центрах оздоровлення та відпочинку; {'\n'}
              • вищих, шкільних та дошкільних навчальних закладах; {'\n'}
              • спортивних секціях і школах; {'\n'}
              • санітарних частинах армій.{'\n'}

            </Text>

            <Text className="text-gray-900 ml-4 text-lg">
              Унікальність методу та апарату зафіксована патентами{' '}
            </Text>
            <Text className="text-gray-700 ml-4">
            • Патент України №7845. Спосіб визначення стійкості організму людини до гіпоксії. 15.07.2005, бюл. №7/2005. {'\n'}
            • Патент України №17698. Спосіб підвищення опірності до гіпоксії організму людини. 16.10.2006, бюл. №10/2006.{'\n'}
            • Патент України № 27105. Спосіб підвищення толерантності до фізичного навантаження у хворих похилого віку зі
             стабільною стенокардією напруги І та ІІ функціональних класів. 25.10.2007, бюл. №17/2007.{'\n'}
            • Патент України №29442. Спосіб діагностики адаптаційної здатності організму людини. 10.01.2008, бюл. №1/2008.{'\n'}
            • Патент України № 37447. Спосіб покращення функціонального стану ендотелію судин літніх хворих зі стабільною стенокардією напруги
              І та ІІ функціональних класів. 25.11.2008, бюл. №22/2008.{'\n'}
            • Патент України №84265. Спосіб оцінки стійкості розумової працездатності людини до гіпоксії. 10.10.2013, бюл. №19/2013.{'\n'}
            • Патент України №74516. Пристрій для дихання гіпоксичними сумішами. 15.12.2005, бюл. №12/2005.{'\n'}
            • Патент України №113908. Автоматизований програмно-апаратний комплекс «Гіпотрон-М». 27.02.2017, бюл. №4/2017.{'\n'}
            • Патент України №123682. Автоматизований програмно-апаратний комплекс для проведення гіпоксичних тренувань. 12.03.2018, бюл. № 5/2018.{'\n'}

            </Text>
          </View>
        </ScrollView>
  )
}
